>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. coboltut.
AUTHOR. Hennermann Marco.
DATE-WRITTEN. July 29th 2020
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 Price PIC 9(4)V99
01 TaxRate PIC V999 value .075
01 FullPrice PIC 9(4)V99.

PROCEDURE DIVISION.
DISPLAY "Enter the Price: " WITH NO ADVANCING
ACCEPT Price
COMPUTE FullPrice ROUNDED =  Price + (Price * TaxRate)
DISPLAY "Price + Tax: " FullPrice

*> STRING OPERATIONS FOLLOWING:
INSPECT SampXtr TALLYING NumChars FOR CHARACTERS.
DISPLAY "Number of Characters: " NumChars.
INSPECCT SampStr TALLYING NumEs FOR ALL 'e'.
DISPLAY "Number of es: " NumEs.
DISPLAY FUNCTION UPPER-CASE(SampStr)
DISPLAY FUNCTION LOWER-CASE(SampStr)

STRING FName DELIMITED BY SIZE
SPACE 
LName DELIMITED BY SIZE
INTO FLName
DISPLAY FLName

STRING FLName DELIMITED BY SPACE
SPACE
MName DELIMITED BY SIZE
SPACE
LName DELIMITED BY SIZE
INTO
FMLName
ON OVERFLOW DISPLAY 'Overflowed'.
DISPLAY FMLName.

STRING SStr1 DELIMITED BY SIZE
SPACE
SStr2 DELIMITED BY "#"
INTO Dest
WITH POINTER Ptr
ON OVERFLOW DISPLAY 'Overflowed'.
DISPLAY Dest.

UNSTRING SStr1 DELIMITED BY SPACE
INTO SStr3, SStr4
END-UNSTRING.
DISPLAY SStr4

STOP RUN.

*> cobc -x coboltut.cob         to load the program
*> ./coboltut                  to run the program